**free
//
// 功能 : 使用SNDRMTCMD建立遠端主機EE controller
// 說明 : 查詢本機現行EE controller清單，根據清單連線至遠端主機修改對應的EE controller
// 組合指令 SNDRMTCMD、VRYCFG(Vary off CTLD)、CHGCTLAPPC、VRYCFG(Vary on CTLD)
// 
ctl-opt option(*srcstmt) dftactgrp(*no) ;